app/controllers/reservations_controller.rb

INSERT INTO "reservations" ("table", "start", "end", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["table", 1], ["start", "2015-05-21 07:09:00.000000"], ["end", "2015-05-21 10:09:00.000000"], ["created_at", "2015-05-21 07:09:58.610620"], ["updated_at", "2015-05-21 07:09:58.610620"]]
---
  def create
    @reservation = Reservation.new(reservation_params)

    respond_to do |format|
      if @reservation.save

DELETE FROM "reservations" WHERE "reservations"."id" = ?  [["id", 1]]
---
  def destroy
    @reservation.destroy